Repository: jubias/program-tester-python
Catalog: l10n/*/LC_MESSAGES/program-tester.po
Languages: pl

source: Program tester. Script runs program on multiple tests and checks program's outputs. Possible responses: OK, COMPLETED, WRONG, ERROR. |n |n OK - program's completed with correct output |n COMPLETED - program's completed, but there is missing *.out file |n WRONG - program's completed, but the output is different than *.out file |n ERROR - program's completed with return code other than 0
pl: Tester programów. Skrypt uruchamia program na serii testów i sprawdza standardowe wyjście. Możliwe odpowiedzi to: OK, SKOŃCZONE, ŹLE, BŁĄD WYKONANIA. |n |n OK - program zakończył się i odpowiedz się zgadza |n SKOŃCZONE - program zakończył się, ale nie istnieje plik *.out |n ŹLE - program zakończył się, ale dał inną odpowiedź |n BŁĄD WYKONANIA - program zwrócił kod wyjścia różny od zera

source: show help message
pl: wyświetl pomoc

source: path to executable binary
pl: ścieżka do programu wykonywalnego

source: path to folder with tests (contains files *.in and *.out)
pl: ścieżka do folderu z testami (zawiera pliki *.in oraz *.out)

source: test's name without suffix .in; program is running only on target test; parameter can be specified multiple times
pl: nazwa testu bez sufiksu .in; program jest testowany na konkretnym teście; parametr może wystąpić więcej niż raz

source: alias for -TC
pl: alias dla -TC

source: alias for -O
pl: alias dla -O

source: do not show execution time
pl: nie wyświetlaj czasu działania programu

source: do not show comparison of program's output and correct answer
pl: nie wyświetlaj porównania odpowiedzi błędnej i poprawnej

source: do not show tests passed correctly
pl: nie wyświetlaj testów, które program przeszedł poprawnie

source: do not show tests passed incorrectly
pl: nie wyświetlaj testów, których program nie przeszedł poprawnie

source: force color even when stdout is not a tty
pl: wymuś włączenie kolorów

source: turn off color
pl: wyłącz kolory

source: do not show summary
pl: nie wyświetlaj podsumowania

source: show script's version number
pl: wyświetl wersję skryptu

source: Executable binary does not exist
pl: Plik wykonywalny nie istnieje

source: Folder with tests does not exist
pl: Folder z testami nie istnieje

source: Correct
pl: Poprawne

source: Completed
pl: Skończone

source: Wrong
pl: Niepoprawne

source: Error
pl: Błędy wykonania

source: time
pl: czas

source: WRONG
pl: ŹLE

source: program's output
pl: wyjście programu

source: correct answer
pl: poprawne wyjście

source: COMPLETED
pl: SKOŃCZONY

source: ERROR
pl: BŁĄD WYKONANIA

source: Python's version
pl: Wersja pythona

source: Required python's version
pl: Wymagana wersja pythona
